{"name":"Josef N. Patoprsty","contact":{"Permanent Address":["474B Clay Road","Rochester, New York, 14623","United States of America"],"E-Mail Address":["seppi@josefnpat.com","jnp4518@rit.edu"],"Telephone Number":["Cell: (616) 990 1604"]},"sections":{"Objective":{"Paragraph":["To obtain a cooperative education position in the field of Computer Engineering, Computer Science or Web Development."]},"Education":{"Header":"Rochester Institute of Technology, Rochester, New York","Table":{"Bachelor of Science":"Computer Engineering Technology - August 2011","Minor":"Computer Science","Concentration":"Writing Studies","GPA":"2.74/4.00","Related Courses":"Technical Programming, Computer Science, Operating Systems, Computer Science Theory, Cryptography, Circuit Theory, Electronics, Differential Equations, Digital Fundamentals, Microcomputers, Digital System Design, Principles of Electronic Design and Automation, Effective Technical Communication, Advanced Electronics, Embedded System Design"}},"Skills":{"Table":{"Languages":"PHP, MySQL, HTML, CSS, Javascript, Windows/Unix/Linux scripting, QBasic 4.5, Borland Turbo Pascal,7.0, Java, C++, C, Brainfuck, Atmel Assembly, VHDL, Python, Lua","Software":"Microsoft Office/Open Office/LibreOffice, Adobe InDesign, Photoshop 5/7/CS/CS2, ExpressPCB, OrCAD Lite, Quartus II, ModelSim, Matlab, Mathematica, Subversion, Mercurial, Git, Drupal","Operating Systems":"Linux, Windows, OS X, Unix","Spoken Languages":"Fluent in German due to residence in Austria (18 years)"}},"Technical Experience":{"Timeline":{"Project Architect (Second School Quarter, 2008)":"Coordinated, analyzed, designed and developed in a team for a movie rental system in C++.","Web Developer (Intermittent)":"Wrote, hosted and maintained many websites over the years using modern technologies.","Lead Developer, (Summer 2008 – Present)":"Designed, developed and contributed to a PHP/MySQL server side development platform that incorporates the use of reusable modules."}},"Professional Experience":{"Timeline":{"Co-Op at Lawrence Productions (Summer 2009)":"Performed network analysis, designed and developed a new the library system, upgraded the internal server, developed platform for an e-commerce website.","Open Publishing Lab at RIT (Present)":"Developing software in PHP/MySQL and XML for a printing job system. Team Oriented with milestones via a wiki, trac and subversion."}},"Activites":{"Paragraph":["Postpunk Band (Guitar, Vocals and Composition), Running, Video Games, RITSMA (RIT Student Music Association) Member, Software Development in Teams"]}}}
