{
  "sections": {
    "Professional Experience": {
      "Timeline": {
        "Manager and Developer at EJEW.IN, LLC (Jan &rarr; Current)":[
          "Developed \"Depression. Decreased Ability to Feel Pleasure. Suicidal Thoughts. Ostriches.\" for Little Afull Jam 2017 and preparing for full release",
          "Managed project in preperation for Steam Release",
          "Designed gameplay, UX and integrated assets",
          "Created story mode and performed and added Voice Overs",
          "Game will be released for Windows/Mac/Linux",
          "Used the Unity3D engine"
        ],
        "Chief Executive Officer at Missing Sentinel Software (2011 &rarr; Current)":[
          "Developed over 45 games",
          "Participated in over 30 Game Jams",
          "Developed and Maintained distribution website using Drupal 7 with over 38,000 Downloads",
          "Worked with many people with many different disciplines",
          "Scored highly in multiple Game Jams (Final Boss &mdash; #111 Audio #199 Humor, Outlaws of Cygnus &mdash; Honerable Mention in Austin Chronicle, The Career of Peter &mdash; Best Art by pico chat podcast, Get Off, Cat! &mdash; #2 Humor #52 Theme #66 Mood #103 Audio #137 Fun, Dino Bros &mdash; #67 Humor #83 Audio #131 Graphics #199 Overall, Bitmo Pirates MMO #37 Innovation, Mini Pirates &mdash; #114 Humor, The Singularity is Here! &mdash; #53 Humor #106 Audio)",
          "Used the Unity3D engine, LÖVE framework, Ren'Py engine and the Pico8 Fantasy Console for many different operating systems"
        ],
        "Contractor for \"Collider\" with Binary Cocoa (June 2015)":[
          "Added menu systems with multiple input systems",
          "Integrated shaders for fantastic visual effect",
          "Set up continious integration systems",
          "Game released on Steam, Humble Indie Bundle and Itch.io for Widnows/Mac/Linux",
          "Used the LÖVE framework"
        ],
        "Contractor for \"HDF: Hexapod Defense Force\" with Binary Cocoa (August 2014)":[
          "Prepared and deployed game to Android OS",
          "Implemented Texture Atlasing system, Spritebatching, Touch Inputs, and Controller Inputs",
          "Set up continious integration systems",
          "Optimized gameplay for Tablets and High-End Android Phones.",
          "Game released on Humble Indie Bundle and Itch.io for Windows/Mac/Linux/Android",
          "Used the LÖVE framework"
        ],
        "Software Engineer at Red Bottle Design (2012 &rarr; Jan 2015)":[
          "Lead developer of Starfire Lords: Genesis.",
          "Designed and prototyped game and story",
          "Set up continious integration systems",
          "Demo released on Itch.io for Windows/Mac/Linux",
          "Used the LÖVE framework"
        ]
      }
    },
    "Skills": {
      "Table": {
        "Languages": "PHP 4/5/7, MySQL 5.x, Lua 5.x, HTML 4/5, CSS 1/2/3, Javascript, Shell/Bash&nbsp;scripting, Java, C, C++, C#, Brainfuck, Atmel&nbsp;Assembly, VHDL, Python 2, QBasic&nbsp;4.5, Borland&nbsp;Turbo&nbsp;Pascal&nbsp;7.0",
        "MVC Frameworks":"Yii&nbsp;1.1, CodeIgniter&nbsp;2.x",
        "Frameworks": "Drupal&nbsp;6,&nbsp;7&nbsp;&&nbsp;8, L&Ouml;VE, Unity3D, Ren'Py, Pico8",
        "Operating Systems": "Linux (Many Variants), Windows, OS X, Android && Unix",
        "Software": "Aegir, Git, Mercurial, Subversion, TeamCity, Wordpress, Apache, Nginx, GIMP, Adobe&nbsp;Photoshop&nbsp;5/7/CS/CS2, Adobe&nbsp;InDesign, Quartus&nbsp;II, ModelSim, ExpressPCB, OrCAD&nbsp;Lite, Matlab, Mathematica, Libre, Open and Microsoft&nbsp;Office",
        "Spoken Languages": "German due to 18 years of residence in Vienna, Austria"
      }
    },
    "Education": {
      "Header": "Rochester Institute of Technology, Rochester, New York &mdash; August 2011",
      "Table": {
        "Bachelor of Science": "Computer Engineering Technology",
        "Minor": "Computer Science",
        "Concentration": "Writing Studies",
        "Related Courses": "Technical&nbsp;Programming, Computer&nbsp;Science, Operating&nbsp;Systems, Computer&nbsp;Science&nbsp; Theory, Cryptography, Circuit&nbsp;Theory, Electronics, Differential&nbsp;Equations, Digital&nbsp;Fundamentals, Microcomputers, Digital&nbsp;System&nbsp;Design, Principles&nbsp;of&nbsp;Electronic&nbsp;Design&nbsp;and&nbsp;Automation, Effective&nbsp;Technical&nbsp;Communication, Advanced&nbsp;Electronics, Embedded&nbsp;System&nbsp;Design"
      }
    },
    "Technical Experience": {
      "Timeline": {
        "Web developer": "Wrote, hosted and maintained many websites over the years using modern technologies such as Drupal and CodeIgniter.",
        "Took Part in the High Tech Rochester Launchpad Class of 2013":"Lean Startup workshop, modeled after Steve Blank's Lean Startup Workshop.",
        "Advocate of Open Source Software":"Authored and contributed. See&nbsp;http://github.com/josefnpat/"
      }
    }
  }
}
