{
  "name": "Josef N. Patoprsty",
  "contact": {
    "E-Mail Address": [
      "seppi@josefnpat.com"
    ],
    "Telephone Number": [
      "(616) 990 1604"
    ],
    "Permanent Address": [
      "474 Clay Road, Apt. B",
      "Rochester, New York, 14623",
      "United States of America"
    ]
  },
  "sections": {
    "Objective": {
      "Paragraph": [
        "To obtain a position in the field of Web&nbsp;Development, Computer&nbsp;Engineering, Computer&nbsp;Science or Game&nbsp;Development."
      ]
    },
    "Education": {
      "Header": "Rochester Institute of Technology, Rochester, New York &mdash; August 2011",
      "Table": {
        "Bachelor of Science": "Computer Engineering Technology",
        "Minor": "Computer Science",
        "Concentration": "Writing Studies",
        "Related Courses": "Technical&nbsp;Programming, Computer&nbsp;Science, Operating&nbsp;Systems, Computer&nbsp;Science&nbsp; Theory, Cryptography, Circuit&nbsp;Theory, Electronics, Differential&nbsp;Equations, Digital&nbsp;Fundamentals, Microcomputers, Digital&nbsp;System&nbsp;Design, Principles&nbsp;of&nbsp;Electronic&nbsp;Design&nbsp;and&nbsp;Automation, Effective&nbsp;Technical&nbsp;Communication, Advanced&nbsp;Electronics, Embedded&nbsp;System&nbsp;Design"
      }
    },
    "Skills": {
      "Table": {
        "Languages": "PHP, MySQL, HTML, CSS, Javascript, Windows/Unix/Linux scripting, QBasic 4.5, Borland Turbo Pascal,7.0, Java, C, C++, Brainfuck, Atmel Assembly, VHDL, Python, Lua",
        "Software": "Libre, Open and Microsoft&nbsp;Office, GIMP, Photoshop&nbsp;5/7/CS/CS2, Adobe&nbsp;InDesign, Quartus&nbsp;II, ModelSim, ExpressPCB, OrCAD&nbsp;Lite, Matlab, Mathematica, Git, Mercurial, Subversion, Drupal 6 & 7, Wordpress",
        "Operating Systems": "Linux (Many Variants), Windows, OS X, Unix",
        "Spoken Languages": "German, 18 years of residence in Vienna, Austria."
      }
    },
    "Professional Experience": {
      "Timeline": {
        "Co-Op and Full Time at Open Publishing Lab at RIT (2011 &rarr; Present)":"Maintained prototype version of BookBag (RIT-aware resource discovery tool) in PHP/MySQL. Assisted development with Rise (live event journalism) in Drupal 6 using OpenAtrium and Mercurial. Lead Developer of current version of BookBag in Drupal 6 using OpenAtrium and Git.",
        "Co-Op at Digital Publishing Center, RIT (2010 &rarr; 2011)":"Maintained and themed for Digital Asset Management system, Xinet, and wrote custom code to improve work flow in PHP/MySQL and javascript.",
        "Co-Op Open Publishing Lab, RIT (2009 &rarr; 2010)": "Developed software in PHP/MySQL and XML for Drop2Print (printing job system). Team Oriented with trac and subversion. Won the Flower City award for best innovation in print publishing technology at the Imagine RIT Festival.",
        "Co-Op at Lawrence Productions (Summer 2009)": "Performed network analysis, designed and developed a new the library system, upgraded the internal server, developed platform for an e-commerce website."
      }
    },
    "Technical Experience": {
      "Timeline": {
        "Web developer": "Wrote, hosted and maintained many websites over the years using modern technologies.",
        "Advocate of Open Source Software":"Authored multiple projects and pushed to others.",
        "Project Architect (Second School Quarter, 2008)": "Coordinated, analyzed, designed and developed in a team for a movie rental system in C++."
      }
    },
    "Activities": {
      "Paragraph": [
        "Stage Performance with guitar and vocals, Independent Video Game Software Development"
      ]
    }
  }
}
